loop.yml
config:
  target: 'https://reqres.in/api'
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - flow:
     - loop: 
         - get:
            url: "/users/{{ $loopElement }}"  
       over:
        - 1
        - 2
        - 3
        - 4
        - 5
        - 6
     - log: "#5 Get user by id"