s1.yml
config:
  target: 'https://reqres.in/api'
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - flow:
  #1 POST https://reqres.in/api/register - rejestrujemy nowego użytkownika, z odpowiedzi przechowujemy id, 
    - post:
        url: "/register"
        json:
          email: "eve.holt@reqres.in"
          password: "pistol"
  # capture - pobieranie danych i przypisanie do zmiennych, przechowujemy id       
        capture:
          json: "$.id"
          as: "new_user_id"
  # log - wyświetla string w terminalu         
    - log: "#1 POST - Register User"
    - log: "#1 Register User id: {{new_user_id}}"    

#2 POST https://reqres.in/api/login - logujemy się na utworzonego użytkownika, z odpowiedzi przechowujemy token, 
    - post:
        url: "/login"
        json:
          email: "eve.holt@reqres.in"
          password: "pistol"
# przechowuje numer tokena
        capture:
          json: "$.token"
          as: "new_user_token"  
    - log: "#2 Log in"
    - log: "#2 Loged user token: {{new_user_token}}"    

#3 PUT https://reqres.in/api/users/{id} - aktualizujemy dane użytkownika podając id z 1, 
    - put:
    # podaje id z pierwszego get
        url: "/users/{{new_user_id}}"
        json:
           name: "NEWname@@@"
           job: "NEWjob@@@"
    - log: "#3 Update User by id"    

#4 GET https://reqres.in/api/users?page=1 - pobieramy listę użytkowników ze strony 1, z odpowiedzi przechowujemy id wszystkich użytkowników, 
    - get:
        url: "/users?page=1"
# przechwytuje id wszystkich userow ze strony 1  
# wiele zmiennych więc dodajemy '-'      
        capture:
         - json: "$.data[0].id"
           as: "id_of_user1"    
         - json: "$.data[1].id"
           as: "id_of_user2"        
         - json: "$.data[2].id"
           as: "id_of_user3"    
         - json: "$.data[3].id"
           as: "id_of_user4"    
         - json: "$.data[4].id"
           as: "id_of_user5"    
         - json: "$.data[5].id"
           as: "id_of_user6"                                        
    - log: "#4 Get list of users from page 1"
    - log: "#4 id of fist user: {{id_of_user1}}"    
    - log: "#4 id of second user: {{id_of_user2}}"    
    - log: "#4 id of second user: {{id_of_user3}}"  
    - log: "#4 id of second user: {{id_of_user4}}"   
    - log: "#4 id of second user: {{id_of_user5}}"   
    - log: "#4 id of second user: {{id_of_user6}}"            
#5 GET https://reqres.in/api/users/{id} - iterując po zebranych id w 4, pobieramy dane każdego z nich. 
# lecimy ze wszystkimi id z #4
    - get:
        url: "/users/{{id_of_user1}}"                
    - log: "#5 Get user by id {{id_of_user1}}"    

    - get:
        url: "/users/{{id_of_user2}}"                
    - log: "#5 Get user by id {{id_of_user2}}"        

    - get:
        url: "/users/{{id_of_user3}}"                
    - log: "#5 Get user by id {{id_of_user3}}"    

    - get:
        url: "/users/{{id_of_user4}}"                
    - log: "#5 Get user by id {{id_of_user4}}"   

    - get:
        url: "/users/{{id_of_user5}}"                
    - log: "#5 Get user by id {{id_of_user5}}"    

    - get:
        url: "/users/{{id_of_user6}}"                
    - log: "#5 Get user by id {{id_of_user6}}"        
# zastąpienie 6x get z pkt. 5 jednym loopem:
# test loop w pliku testloop
     
    - loop: 
        - get:
           url: "/users/{{ $loopElement }}"  
      over:
      - "{{id_of_user1}}"
      - "{{id_of_user2}}"
      - "{{id_of_user3}}"
      - "{{id_of_user4}}"
      - "{{id_of_user5}}"
      - "{{id_of_user6}}"
    - log: "#5 Get user by ids from step 4. Users ids are: {{id_of_user1}},{{id_of_user2}},{{id_of_user3}},{{id_of_user4}},{{id_of_user5}},{{id_of_user6}}"