s1.yml
#artillery documentation https://artillery.io/docs/http-reference/
#reqres API documentation https://reqres.in/
#remember that all the spaces in the code are very important.
#let's start by setting up the configuration section.
config:
  target: 'https://reqres.in/api'
  phases:
    - duration: 1
      arrivalRate: 1
#now we have to prepare a test scenario
scenarios:
  - flow:
#1 POST https://reqres.in/api/register - we register a new user, from the answers we store the id
    - post:
        url: "/register"
        json:
          email: "eve.holt@reqres.in"
          password: "pistol"
        #capture - is the section where we can retrieve data     
        capture:
          #we get the id
          json: "$.id"
          #assign id to a variable
          as: "new_user_id"
    # log - debug messages can be logged with the log action, the string will be displayed in the terminal     
    - log: " "
    - log: " "
    - log: "#1 POST - a new user has been registered."
    - log: "   the new user's id is: {{new_user_id}}"    
    - log: " "
    - log: " "

#2 POST https://reqres.in/api/login - we log on to the created user, from answers we store the token.
    - post:
        url: "/login"
        json:
          email: "eve.holt@reqres.in"
          password: "pistol"

        capture:
          json: "$.token"
          as: "new_user_token"    
    - log: "#2 POST - the user is logged in."
    - log: "   the user's token is: {{new_user_token}}"    
    - log: " "
    - log: " "

#3 PUT https://reqres.in/api/users/{id} - we update the user data with the id of point #1
    - put:
        #id variable
        url: "/users/{{new_user_id}}"
        json:
           name: "NEWname@@@"
           job: "NEWjob@@@"    
    - log: "#3 PUT - The data of the user who has id={{new_user_id}} has been updated."    
    - log: " "
    - log: " "

#4 GET https://reqres.in/api/users?page=1 - we download a list of users from page 1, from the answers we store the id of all users
    - get:
        url: "/users?page=1"

        capture:
         #when you want to store many variable hyphens'-' are necessary.
         - json: "$.data[0].id"
           as: "id_of_user1"    
         - json: "$.data[1].id"
           as: "id_of_user2"        
         - json: "$.data[2].id"
           as: "id_of_user3"    
         - json: "$.data[3].id"
           as: "id_of_user4"    
         - json: "$.data[4].id"
           as: "id_of_user5"    
         - json: "$.data[5].id"
           as: "id_of_user6"                                              
    - log: "#4 GET - list of users from page 1"
    - log: "   id of fist user: {{id_of_user1}}" 
    - log: "   id of second user: {{id_of_user2}}"    
    - log: "   id of third user: {{id_of_user3}}"    
    - log: "   id of fourth user: {{id_of_user4}}"  
    - log: "   id of fifth user: {{id_of_user5}}"   
    - log: "   id of sixth user: {{id_of_user6}}"   
    - log: " " 
    - log: " "
               
#5 GET https://reqres.in/api/users/{id} - iterating after the id collected in #4, we retrieve the data of each of them.    
    #the beginning of the loop.
    - loop: 
        - get:
           #a variable that will take all values written in 'over' section
           url: "/users/{{ $loopElement }}"  
      over:
      #the variables have to be transmitted in quotation marks.
      - "{{id_of_user1}}"
      - "{{id_of_user2}}"
      - "{{id_of_user3}}"
      - "{{id_of_user4}}"
      - "{{id_of_user5}}"
      - "{{id_of_user6}}"

    - log: "#5 Get user by ids from step 4. Users ids are: {{id_of_user1}},{{id_of_user2}},{{id_of_user3}},{{id_of_user4}},{{id_of_user5}},{{id_of_user6}}"         
    - log: " "
    
## THE END
## execute by 'rtillery run /Users/wezu/Artilleryreqres/s1.yml'
## if you want to see the answer from api execute by 'DEBUG=http,http:response artillery run /Users/wezu/Artilleryreqres/s1.yml'


#This is point #5 without looping
#    - get:
#        url: "/users/{{id_of_user1}}"                
#    - log: "#5 Get user by id {{id_of_user1}}"    

#    - get:
#        url: "/users/{{id_of_user2}}"                
#    - log: "#5 Get user by id {{id_of_user2}}"        

#    - get:
#        url: "/users/{{id_of_user3}}"                
#    - log: "#5 Get user by id {{id_of_user3}}"    

#    - get:
#        url: "/users/{{id_of_user4}}"                
#    - log: "#5 Get user by id {{id_of_user4}}"   

#    - get:
#        url: "/users/{{id_of_user5}}"                
#    - log: "#5 Get user by id {{id_of_user5}}"    

#    - get:
#        url: "/users/{{id_of_user6}}"                
#    - log: "#5 Get user by id {{id_of_user6}}"